package com.lanjiyin.emptydemo

import android.os.Bundle
import androidx.appcompat.app.AppCompatActivity
import com.lanjiyin.emptydemo.highlight_text.SelectableTextHelper
import kotlinx.android.synthetic.main.activity_main.*


class MainActivity : AppCompatActivity() {

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)
        var text = "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿" +
                "的啊啊所多asdasd案例库；拉开敬老卡圣诞节离开静安寺的了解了解开健康记录记录卡顿拉开距离看见了卡坚实的拉开距离框架拉可适当就快了极乐空间奥斯卡来得及开了尽快了解骷髅精灵卡顿"
        textview.text = text
    }
}
